{
  "</tool_call>": 151658,
  "<LABEL_中立>": 151670,
  "<LABEL_农业>": 151673,
  "<LABEL_国际>": 151665,
  "<LABEL_市场>": 151667,
  "<LABEL_政治>": 151676,
  "<LABEL_政策>": 151669,
  "<LABEL_未知>": 151678,
  "<LABEL_消极>": 151677,
  "<LABEL_煤炭>": 151672,
  "<LABEL_畜牧>": 151675,
  "<LABEL_积极>": 151671,
  "<LABEL_经济活动>": 151666,
  "<LABEL_能源>": 151674,
  "<LABEL_金属>": 151668,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
